afn= {
    [0x0] = "确认/否认",
    [0x1] = "初始化",
    [0x2] = "数据转发",
    [0x3] = "查询数据",
    [0x4] = "链路接口检测",
    [0x5] = "控制命令",
    [0x6] = "主动上报",
    [0x10] = "路由查询",
    [0x11] = "路由设置",
    [0x12] = "路由控制",
    [0x13] = "路由数据转发",
    [0x14] = "路由数据抄读",
    [0xF0] = "内部调试",
}

fn = {
    [0x0] = {
            [0x1] = "确认",
            [0x2] = "否认"
    },
    [0x1] = {
            [0x1] = "硬件初始化",
            [0x2] = "参数区初始化",
            [0x3] = "数据区初始化"
        },
    [0x2] = {
            [0x1] = "转发命令"
        },
    [0x3] = {
            [0x1] = "厂商代码和版本信息",
            [0x2] = "噪音值",
            [0x3] = "载波从节点侦听信息",
            [0x4] = "载波主节点地址",
            [0x5] = "载波主节点状态字和载波速率",
            [0x6] = "载波主节点干扰状态",
            [0x7] = "查询台区编号"
        },
    [0x4] = {
            [0x1] = "发送测试",
            [0x2] = "载波从节点点名"
        },
    [0x5] = {
            [0x1] = "设置载波主节点地址",
            [0x2] = "允许载波从节点上报",
            [0x3] = "启动广播",
            [0x4] = "设置台区编号"
        },
    [0x6] = {
            [0x1] = "上报载波从节点信息",
            [0x2] = "上报抄读数据"
        },
    [0x10] = {
            [0x1] = "载波从节点数量",
            [0x2] = "载波从节点信息",
            [0x3] = "指定载波从节点的上一级中继路由信息",
            [0x4] = "路由运行状态",
            [0x5] = "为抄读成功的载波从节点信息",
            [0x6] = "主动注册的载波从节点信息"
        },
    [0x11] = {
            [0x1] = "添加载波从节点",
            [0x2] = "删除载波从节点",
            [0x3] = "设置载波从节点古代中继路径",
            [0x4] = "设置工作模式",
            [0x5] = "激活载波从节点主动注册"
        },
    [0x12] = {
            [0x1] = "重启",
            [0x2] = "暂停",
            [0x3] = "恢复"
        },
    [0x13] = {
            [0x1] = "监控载波从节点"
        },
    [0x14] = {
            [0x1] = "路由请求抄读内容"
        }
}

afn00fn2 = {
    [0] = "通信超时",
    [1] = "无效数据单元",
    [2] = "长度错误",
    [3] = "效验错误",
    [4] = "信息类不存在",
    [5] = "格式错误",
    [6] = "表号重复",
    [7] = "表号不存在",
    [8] = "电表应用层无应答",
    [9] = "备用"
}

-- DL/T 645 控制码D4~D0功能码
funstr = {
    [0x00] = "保留",
    [0x08] = "广播校时",
    [0x11] = "读数据",
    [0x12] = "读后续数据",
    [0x13] = "读通讯地址",
    [0x14] = "写数据",
    [0x15] = "写通讯地址",
    [0x16] = "冻结命令",
    [0x17] = "更改通讯速率",
    [0x18] = "修改密码",
    [0x19] = "最大需量清零",
    [0x1A] = "电表清零",
    [0x1B] = "事件清零"
}